app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    @projects = Project.order(params[:sort]).page(params[:page]).per(3)